# IDirectContext3DServer Interface

---
C#Visual BasicVisual C++
Revit 2024 API
---
IDirectContext3DServer Interface
Members See Also
---
The interface to be implemented by a server of the DirectContext3D external service.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public interface IDirectContext3DServer : IExternalServer
```

Visual Basic
---
```text
Public Interface IDirectContext3DServer _
	Inherits IExternalServer
```

Visual C++
---
```text
public interface class IDirectContext3DServer : IExternalServer
```

# See Also
IDirectContext3DServer Members
Autodesk.Revit.DB.DirectContext3D Namespace